#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.dynamic_subnets.module.utils.data.aws_regions.opted_in: Reading...
module.dynamic_subnets.module.utils.data.aws_regions.not_opted_in: Reading...
module.dynamic_subnets.module.utils.data.aws_regions.complete: Reading...
module.dynamic_subnets.module.utils.data.aws_regions.default: Reading...
module.dynamic_subnets.data.aws_availability_zones.default[0]: Reading...
module.vpc.aws_vpc.default[0]: Refreshing state... [id=vpc-009113f13a599a330]
module.dynamic_subnets.module.utils.data.aws_regions.not_opted_in: Read complete after 0s [id=aws]
module.dynamic_subnets.module.utils.data.aws_regions.default: Read complete after 0s [id=aws]
module.dynamic_subnets.module.utils.data.aws_regions.opted_in: Read complete after 0s [id=aws]
module.dynamic_subnets.data.aws_availability_zones.default[0]: Read complete after 0s [id=eu-west-2]
module.dynamic_subnets.module.utils.data.aws_regions.complete: Read complete after 0s [id=aws]
module.dynamic_subnets.data.aws_vpc.default[0]: Reading...
module.vpc.aws_default_security_group.default[0]: Refreshing state... [id=sg-01914e6fda4b47ab4]
module.vpc.aws_internet_gateway.default[0]: Refreshing state... [id=igw-0c255c6f8c041d2e3]
module.dynamic_subnets.aws_route_table.private[2]: Refreshing state... [id=rtb-09b4ce21efd237180]
module.dynamic_subnets.aws_route_table.private[1]: Refreshing state... [id=rtb-0e89938b479a4f22f]
module.dynamic_subnets.aws_route_table.private[0]: Refreshing state... [id=rtb-0b765231b1cd54b54]
module.dynamic_subnets.aws_route_table.public[0]: Refreshing state... [id=rtb-036d1eb5858c48377]
module.dynamic_subnets.aws_route.public[0]: Refreshing state... [id=r-rtb-036d1eb5858c483771080289494]
module.dynamic_subnets.data.aws_vpc.default[0]: Read complete after 1s [id=vpc-009113f13a599a330]
module.dynamic_subnets.aws_subnet.private[2]: Refreshing state... [id=subnet-0757ea0b9aa8b1905]
module.dynamic_subnets.aws_subnet.private[0]: Refreshing state... [id=subnet-03363401b701c0192]
module.dynamic_subnets.aws_subnet.public[2]: Refreshing state... [id=subnet-080e4686fb6af02db]
module.dynamic_subnets.aws_subnet.public[0]: Refreshing state... [id=subnet-07d0f68ddec76c093]
module.dynamic_subnets.aws_subnet.private[1]: Refreshing state... [id=subnet-0ea23e3cd8591b717]
module.dynamic_subnets.aws_subnet.public[1]: Refreshing state... [id=subnet-02b9ad0df5d6be999]
module.dynamic_subnets.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0a60ca583e16878f2]
module.dynamic_subnets.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-046fbaf13e9009eb8]
module.dynamic_subnets.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0330b9b10cd5d8273]
module.dynamic_subnets.aws_network_acl.private[0]: Refreshing state... [id=acl-0e201fd43623ce6b3]
module.dynamic_subnets.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0af19d8609c79a2c8]
module.dynamic_subnets.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-01e7dc066ea565010]
module.dynamic_subnets.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0867802849ff830ff]
module.dynamic_subnets.aws_network_acl.public[0]: Refreshing state... [id=acl-081a94a3fbc7d4d73]
module.dynamic_subnets.aws_network_acl_rule.private4_ingress[0]: Refreshing state... [id=nacl-3318788472]
module.dynamic_subnets.aws_network_acl_rule.private4_egress[0]: Refreshing state... [id=nacl-1793541639]
module.dynamic_subnets.aws_network_acl_rule.public4_egress[0]: Refreshing state... [id=nacl-717500771]
module.dynamic_subnets.aws_network_acl_rule.public4_ingress[0]: Refreshing state... [id=nacl-2404333390]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.smb_fileserver_sg.aws_security_group.cbd[0] will be created
  + resource "aws_security_group" "cbd" {
      + arn                    = (known after apply)
      + description            = "SMB File Server Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-009113f13a599a330"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.smb_fileserver_sg.aws_security_group_rule.dbc["_allow_all_egress_"] will be created
  + resource "aws_security_group_rule" "dbc" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.smb_fileserver_sg.aws_security_group_rule.dbc["allow_all"] will be created
  + resource "aws_security_group_rule" "dbc" {
      + description              = "Inbound from all resources in this SG"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.smb_fileserver_sg.aws_security_group_rule.dbc["smb_vpc"] will be created
  + resource "aws_security_group_rule" "dbc" {
      + cidr_blocks              = [
          + "10.1.0.0/24",
        ]
      + description              = "SMB from VPC network"
      + from_port                = 445
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 445
      + type                     = "ingress"
    }

  # module.wireguard_vpn_sg.aws_security_group.cbd[0] will be created
  + resource "aws_security_group" "cbd" {
      + arn                    = (known after apply)
      + description            = "SMB File Server Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-009113f13a599a330"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["_allow_all_egress_"] will be created
  + resource "aws_security_group_rule" "dbc" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["allow_all"] will be created
  + resource "aws_security_group_rule" "dbc" {
      + description              = "Inbound from all resources in this SG"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["smb_envoy"] will be created
  + resource "aws_security_group_rule" "dbc" {
      + cidr_blocks              = [
          + "192.168.1.0/24",
        ]
      + description              = "SMB from Envoy Office"
      + from_port                = 445
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 445
      + type                     = "ingress"
    }

  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["ssh_gr_home"] will be created
  + resource "aws_security_group_rule" "dbc" {
      + cidr_blocks              = [
          + "154.59.148.74/32",
        ]
      + description              = "SSH from GR home"
      + from_port                = 22
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.wireguard_vpn_sg.aws_security_group_rule.dbc["wireguard_envoy"] will be created
  + resource "aws_security_group_rule" "dbc" {
      + cidr_blocks              = [
          + "157.231.92.5/32",
        ]
      + description              = "Wireguard from Envoy Office"
      + from_port                = 51820
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 51820
      + type                     = "ingress"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @gerrardrose, Action: `pull_request`*